In [23]:
import duckdb 
import pandas as pd
import polars as pl
import matplotlib.pyplot as plt
import seaborn as sns


%load_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

%sql duckdb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
path_data="../datasets/"
file_data_bruto = "competencia_02_crudo.csv.gz"
path_data_bruto=path_data + file_data_bruto

In [26]:
%%sql
create or replace table df as 
select *
from read_csv_auto('../datasets/datasets_competencia_02_crudo.csv.gz')

     Count
0  4717958

In [27]:
%%sql
select distinct(foto_mes)
from df
order by foto_mes

    foto_mes
0     201901
1     201902
2     201903
3     201904
4     201905
5     201906
6     201907
7     201908
8     201909
9     201910
10    201911
11    201912
12    202001
13    202002
14    202003
15    202004
16    202005
17    202006
18    202007
19    202008
20    202009
21    202010
22    202011
23    202012
24    202101
25    202102
26    202103
27    202104
28    202105
29    202106
30    202107
31    202108

In [30]:
%%sql
select foto_mes , count(distinct(cliente_edad))
from df 
group by foto_mes

    foto_mes  count(DISTINCT cliente_edad)
0     202005                            80
1     201906                            81
2     201910                            81
3     201904                            80
4     202006                            81
5     202102                            82
6     201907                            80
7     202010                            81
8     201908                            80
9     202105                            81
10    202103                            82
11    202008                            80
12    202101                            81
13    202108                            80
14    201905                            80
15    202104                            81
16    202012                            80
17    202107                            80
18    202007                            80
19    201902                            81
20    202009                            81
21    201912                            80
22    201901                            81
23    202011                            81
24    201911                            80
25    201903                            80
26    202002                            81
27    202004                            80
28    202001                            81
29    202003                            81
30    201909                            81
31    202106                            81